"""
Автор: Г. Гутман
Максимум достигается на строке, которая содержит 195 троек 011 и 65 троек 000,
например
s='_'+195*'011'+65*'000'+'_'
или
s='_'+65*'000'+195*'011'+'_'
Ответ:  650
Проверим результат программой
"""
mt=[[('_','R',1)],
    [('_','S',1),('0','R',2),('1','R',2)],
    [('_','S',2),('1','R',3),('0','R',3)],
    [('_','S',3),('1','R',1),('0','R',1)]]
alf='_01'; p=0

def cmd(mt,s,p):
    q=0; res=list(s)
    while True:
        out,dr,nxt=mt[q][alf.index(res[p])]
        res[p]=out
        if dr=='R': p+=1
        if dr=='L': p-=1
        if dr=='S': return(''.join(res))
        q=nxt

s='_'+195*'011'+65*'000'+'_'
res=cmd(mt,s,p)
print(s.count('0'),s.count('1'))
print(res.count('0'),res.count('1'))
"""
Результат:
390 390     # число нулей и единиц в исходной строке
650 130     # число нулей и единиц в конечной строке
"""