'''
Автор: М. А. Черкасов

443) (Р. Косов) На ленте исполнителя МТ в соседних ячейках записана
последовательность из 1000 символов, включающая только
нули и единицы. Ячейки справа и слева от последовательности
заполнены пустыми символами «λ».
В начальный момент времени головка расположена в ближайшей
ячейке справа от последовательности. Программа для исполнителя:
	   λ	           0	           1
q0	λ, L, q1
q1	λ, S, q1	0, L, q1	1, L, q2
q2	λ, S, q2	2, L, q2	1, S, q2
Команды движения каретки: L – влево, R – вправо, S – стоп.
В результате на ленте оказалась последовательность с суммой цифр,
превышающей 1200.
Определите минимально возможное число нулей в исходной
последовательности.
= 201


'''
print(' λ0000000111111100000001λ')
print('  123...a123...b123...c  ' )
print(' быстро      < 1 секунды')
#    'λLq'
min0 = 99999
for a in range( 990 ):
  for b in range(1, 998-a):
    c = 1000 -1 -a -b
    summ = 2*c + b + 1
    if summ > 1200 :
      if a+c < min0 :
        min0 = a+c
        A = a ; B = b; C = c; SUMM = summ
print('a b c   min0 summ =',A , B , C ,' ', min0, SUMM )
print('=', min0)

print('-----------------------------')
print('   мееедленно     46 секунд')

def MT(s):
#q0:
  if ( s[-1] != 'λ' ) or ( s[0] != 'λ' ) :
    print(' ошибка в строке' )
    return 0
#q1:
  else:
    for i in range(len(s)-2, 0, -1):
      if s[i] == 'λ' :
        return 0
      elif s[i] == '0': continue
      elif s[i] == '1': break
#q2:
    for j in range(i-1, 0, -1)  :
      if   s[j] == 'λ' or s[j] == '1':  return s
      elif s[j] == '0' : s[j] = '2'
    return s

L = 1000 ; summ = 1200
#L = 100 ; summ = 120

print(' λ0000000111111100000001λ')
print('    a      b      c      ' )

min0 = 88**88

for a in range( L-3):
  for b in range(1, L -a -1):
#                          b от [ 1 до L-a-2 ] включительно

        c = L - 1 - a - b
        s = 'λ' + a*'0' + b*'1'  + c*'0' + '1' + 'λ'
        s = [i for i in s]
        s0 = s.copy()
        ss = MT(s)

        s1 = ss[1:L+1]
        if sum([int(c) for c in s1]) > summ :
          if a+c < min0 :
            min0 = a+c; AA = a; BB = b; CC = c; s00 = s0; s2 = ss


print('min0 , AA,BB,CC=',min0 , AA,BB,CC)
print('=', min0)







