# задача 14.222
# Автор: А.Л. Наймушин
x = 4**3*3**19
count0 = 0
count1 = 0
count2 = 0

while x:
    if x % 3 == 0:
        count0 += 1
    elif x % 3 == 1:
        count1 += 1
    else: count2 += 1
        
    x //= 3
print( 'Ответ: ', '"0" = ',count0,',', '"1" = ',count1,',', '"2" = ',count2   )

# Ответ:  "0" =  20 , "1" =  2 , "2" =  1

#14.222)Е.А. Мирончик) Выражение 4**3*3**19 записано в троичной системе счисления.
#Определите,  сколько в этой записи цифр 0 (, 1 и 2).
