Задача №16 (вариант 25)
==================================================

25) Определите, сколько символов * выведет эта процедура при вызове F(140):
Python Паскаль C++
3 http://kpolyakov. spb .ru
© К. Поляков, 2019-2025
def F( n ): procedure F( n: integer ); void F( int n )
print('*') begin {
if n >= 1: write('*'); cout << '*';
print('*') if n >= 1 then begin if( n >= 1 ) {
F(n-1) write('*'); cout << '*';
F(n//2) F(n-1); F(n-1);
F(n div 2); F(n/2);
end; }
end; }
